       01  TRX-RECORD.
           05 TRX-HEADER        PIC X(1).
           05 FILLER            PIC X(1).
           05 TRX-DATE          PIC X(8).
           05 FILLER            PIC X(1).
           05 TRX-SEQ           PIC X(10).
           05 FILLER            PIC X(1).
           05 INST-CD           PIC X(4).
           05 FILLER            PIC X(1).
           05 ACC-NO            PIC X(15).
           05 FILLER            PIC X(1).
           05 TRX-TYPE          PIC X(1).
           05 FILLER            PIC X(1).
           05 TRX-AMT           PIC 9(12).
           