       01  TRX-RECORD.
           05 TRX-DATE       PIC X(8).
           05 TRX-SEQ        PIC 9(10).
           05 INST-CD        PIC X(4).
           05 ACC-NO         PIC X(15).
           05 TRX-TYPE       PIC X(1).
           05 TRX-AMT        PIC 9(12).
           